src/Enums/СтатусыКассовойСменыМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСменыМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытаЧекиЗаархивированы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусЧекаККММП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтатусЧекаККММП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПробит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СистемыНалогообложенияМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложенияМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяДоход</Name>
					<Comment>УСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяДоходМинусРасход</Name>
					<Comment>УСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалогНаВмененныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйСельскохозяйственныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Патентная</Name>
					<Comment>Патентная система налогообложения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыТоваровМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыТоваровМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПризнакиПредметаРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПризнакиПредметаРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Реализуемый товар, за исключением подакцизного товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Comment>Реализуемый подакцизный товар</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
					<Comment>Выполняемая работа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Оказываемая услуга</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаАзартнойИгры</Name>
					<Comment>Прием ставок при осуществлении деятельности по проведению азартных игр</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыигрышАзартнойИгры</Name>
					<Comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению азартных игр</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛотерейныйБилет</Name>
					<Comment>Прием денежных средств при реализации лотерейных билетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыигрышЛотереи</Name>
					<Comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению лотерей</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставлениеРИД</Name>
					<Comment>Предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежВыплата</Name>
					<Comment>Аванс, задаток, предоплата, кредит, взнос в счет оплаты, пени, штраф, вознаграждение, бонус и ином аналогичном предмете расчета</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгентскоеВознаграждение</Name>
					<Comment>Вознаграждение пользователя, являющегося платежным агентом (субагентом), банковским платежным агентом (субагентом), комиссионером, поверенным или иным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоставнойПредметРасчета</Name>
					<Comment>Предмет расчета, состоящем из предметов, каждому из которых может быть присвоено другие значения перечисления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнойПредметРасчета</Name>
					<Comment>Предмет расчета,  не относящемуся к предметам расчета, которым может быть присвоено значение перечисления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмущественноеПраво</Name>
					<Comment>Передача имущественных прав</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнереализационныйДоход</Name>
					<Comment>Внереализационный доход</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы</Name>
					<Comment>Сумма расходов, уменьшающих сумму налога (авансовых платежей) в соответствии с пунктом 3.1 статьи 346.21 Налогового кодекса РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
					<Comment>Сумма уплаченного торгового сбора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурортныйСбор</Name>
					<Comment>Курортный сбор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Платеж</Name>
					<Comment>Об авансе, задатке, предоплате и кредите</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплата</Name>
					<Comment>О взносе в счет оплаты пени, штрафе, вознаграждении, бонусе и ином аналогичном предмете расчета</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
					<Comment>О суммах произведенных расходов в соответствии со статьей 346.16 Налогового кодекса Российской Федерации, уменьшающих доход</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеПенсионноеСтрахованиеИП</Name>
					<Comment>О страховых взносах на обязательное пенсионное страхование, уплачиваемых ИП, не производящими выплаты и иные вознаграждения физическим лицам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеПенсионноеСтрахование</Name>
					<Comment>О страховых взносах на обязательное пенсионное страхование, уплачиваемых организациями и ИП, производящими выплаты и иные вознаграждения физическим лицам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеМедицинскоеСтрахованиеИП</Name>
					<Comment>О страховых взносах на обязательное медицинское страхование, уплачиваемых ИП, не производящими выплаты и иные вознаграждения физическим лицам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеМедицинскоеСтрахование</Name>
					<Comment>О страховых взносах на обязательное медицинское страхование, уплачиваемые организациями и ИП, производящими выплаты и иные вознаграждения физическим лицам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеСоциальноеСтрахование</Name>
					<Comment>О страховых взносах на обязательное социальное страхование на случай временной нетрудоспособности и в связи с материнством, на обязательное социальное страхование от несчастных случаев на производстве и профессиональных заболеваний</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежКазино</Name>
					<Comment>О приеме и выплате денежных средств при осуществлении деятельности казино с использованием обменных знаков казино, зале игровых автоматов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредств</Name>
					<Comment>Выдача денежных средств банковским платежным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодакцизныйТоварПодлМаркировкеСИНеИмеющийКМ</Name>
					<Comment>Подакцизный товар, подлежащий маркировке средством идентификации, не имеющем кода маркировки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодакцизныйТоварПодлМаркировкеСИИмеющийКМ</Name>
					<Comment>Подакцизный товар, подлежащий маркировке средством идентификации, имеющем код маркировки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркированныйТоварПодлМаркировкеСИНеИмеющийКМ</Name>
					<Comment>Товар подлежащей маркировке средством идентификации, не имеющем кода маркировки, за исключением подакцизного товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркированныйТоварПодлМаркировкеСИИмеющийКМ</Name>
					<Comment>Товар подлежащей маркировке средством идентификации, имеющем код маркировки, за исключением подакцизного товара</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ОтчетОРозничныхПродажахМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ОтчетОРозничныхПродажахМП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСменыМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозничнаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницыМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККММП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКартой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварыМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/РозничныеПродажиМПСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает пустую структуру состояния кассовой смены.
//
Функция ПолучитьСтруктуруОписанияКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;
	СостояниеКассовойСмены.Вставить("НачалоКассовойСмены");
	СостояниеКассовойСмены.Вставить("ОкончаниеКассовойСмены");
	СостояниеКассовойСмены.Вставить("СтатусКассовойСмены");
	СостояниеКассовойСмены.Вставить("ОтчетОРозничныхПродажах");
	//СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	
	// Описание реквизитов кассовой смены.
	//СостояниеКассовойСмены.Вставить("КассаККМ");
	//СостояниеКассовойСмены.Вставить("Организация");
	//СостояниеКассовойСмены.Вставить("Кассир");
	//СостояниеКассовойСмены.Вставить("СтруктурнаяЕдиница");
	//СостояниеКассовойСмены.Вставить("ВалютаДокумента");
	//СостояниеКассовойСмены.Вставить("ВалютаДокументаПредставление");
	//СостояниеКассовойСмены.Вставить("ОтчетОРозничныхПродажах");
	//СостояниеКассовойСмены.Вставить("ВидЦен");
	//СостояниеКассовойСмены.Вставить("Подразделение");
	//СостояниеКассовойСмены.Вставить("СуммаВключаетНДС");
	//СостояниеКассовойСмены.Вставить("НДСВключатьВСтоимость");
	//СостояниеКассовойСмены.Вставить("НалогообложениеНДС");
	//СостояниеКассовойСмены.Вставить("Ответственный");
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
Функция ПолучитьСостояниеКассовойСмены() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСменаДокумент.Номер КАК НомерКассовойСмены,
	|	КассоваяСменаДокумент.Ссылка КАК ОтчетОРозничныхПродажах,
	|	КассоваяСменаДокумент.Статус КАК СтатусКассовойСмены,
	|	КассоваяСменаДокумент.НачалоКассовойСмены КАК НачалоКассовойСмены,
	|	КассоваяСменаДокумент.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены,
	|	ВЫБОР
	|		КОГДА КассоваяСменаДокумент.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСменыМП.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажахМП КАК КассоваяСменаДокумент
	|ГДЕ
	|	НЕ КассоваяСменаДокумент.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСменаДокумент.Дата УБЫВ,
	|	ОтчетОРозничныхПродажах УБЫВ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции

// Функция выполняет закрытие кассовой смены.
//
Функция ЗаполнитьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект) Экспорт
	
	СтруктураВозвращаемоеЗначение = Новый Структура;
	СтруктураВозвращаемоеЗначение.Вставить("ОтчетОРозничныхПродажах");
	СтруктураВозвращаемоеЗначение.Вставить("ОписаниеОшибки");
	
	//МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Подготовка данных.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМЗапасы.Товар КАК Товар,
	|	СУММА(ЧекККМЗапасы.Количество) КАК Количество,
	|	ЧекККМЗапасы.Цена КАК Цена,
	|	СУММА(ЧекККМЗапасы.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМЗапасы.Товар КАК Товар,
	|		ЧекККМЗапасы.Количество КАК Количество,
	|		ЧекККМЗапасы.Цена КАК Цена,
	|		ЧекККМЗапасы.Сумма КАК Сумма
	|	ИЗ
	|		Документ.ЧекККММП.Товары КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЧекаККММП.Пробит)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМЗапасы.Товар,
	|		-ЧекККМЗапасы.Количество,
	|		ЧекККМЗапасы.Цена,
	|		-ЧекККМЗапасы.Сумма
	|	ИЗ
	|		Документ.ЧекККМВозвратМП.Товары КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЧекаККММП.Пробит)) КАК ЧекККМЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМЗапасы.Товар,
	|	ЧекККМЗапасы.Цена";
	
	//Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОтчетОРозничныхПродажах", ОтчетОРозничныхПродажахОбъект.Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Запасы = Результат[0].Выгрузить();
	ОтчетОРозничныхПродажахОбъект.Товары.Очистить();
	
	Для каждого СтрокаТЧ Из Запасы Цикл
		
		Если СтрокаТЧ.Сумма <> 0 Тогда
			СтрокаТабличнойЧастиЗапасы = ОтчетОРозничныхПродажахОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧастиЗапасы, СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	ОтчетОРозничныхПродажахОбъект.Статус = Перечисления.СтатусыКассовойСменыМП.Закрыта;
	Если ОтчетОРозничныхПродажахОбъект.ДополнительныеСвойства.Свойство("ЗагрузкаИзВнешнегоИсточника") <> Истина Тогда
		ДатаЗакрытияКассовойСмены = ТекущаяДата();
		ОтчетОРозничныхПродажахОбъект.Дата = ДатаЗакрытияКассовойСмены;
		ОтчетОРозничныхПродажахОбъект.ОкончаниеКассовойСмены = ДатаЗакрытияКассовойСмены;
	КонецЕсли;
	ОтчетОРозничныхПродажахОбъект.СуммаДокумента = ОтчетОРозничныхПродажахОбъект.Товары.Итог("Сумма");
	
	ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
	СтруктураВозвращаемоеЗначение.ОписаниеОшибки = "";
	СтруктураВозвращаемоеЗначение.ОтчетОРозничныхПродажах = ОтчетОРозничныхПродажахОбъект.Ссылка;
	
	Попытка
		ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СтруктураВозвращаемоеЗначение.ОписаниеОшибки = НСтр("ru = 'При формировании отчета о розничных продажах произошла ошибка.'");
		// Сбор статистики
		Инфо = ИнформацияОбОшибке();
		ПолноеОписание = ПодробноеПредставлениеОшибки(Инфо);
		СборСтатистикиМПКлиентСерверПереопределяемый.ОтправитьОшибкуВGA(ПолноеОписание);
		// Конец сбор статистики
	КонецПопытки;
		
	Возврат СтруктураВозвращаемоеЗначение;
	
КонецФункции // ЗакрытьОтчетОРозничныхПродажах()

// Функция выполняет открытие кассовой смены.
//
Функция ОткрытьКассовуюСмену(ОтчетОРозничныхПродажах = Неопределено) Экспорт
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены();
	ДатаОткрытияКассовойСмены = ТекущаяДата();
	
	НужноОткрытьКассовуюСмену = Ложь;
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСменыМП.Открыта Тогда
		// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
		Если ДатаОткрытияКассовойСмены - СтруктураСостояниеКассовойСмены.НачалоКассовойСмены < 86400 Тогда
			ОтчетОРозничныхПродажах = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
		Иначе
			ЗакрытьКассовуюСмену();
			НужноОткрытьКассовуюСмену = Истина;
		КонецЕсли;
	Иначе
		НужноОткрытьКассовуюСмену = Истина;
	КонецЕсли;
	
	Если НужноОткрытьКассовуюСмену Тогда;
		
		// Смена закрыта. Откроем новую кассовую смену.
		НовыйДокумент = Документы.ОтчетОРозничныхПродажахМП.СоздатьДокумент();
		НовыйДокумент.Дата                   = ДатаОткрытияКассовойСмены;
		НовыйДокумент.Статус                 = Перечисления.СтатусыКассовойСменыМП.Открыта;
		НовыйДокумент.НачалоКассовойСмены    = ДатаОткрытияКассовойСмены;
		НовыйДокумент.ОкончаниеКассовойСмены = '00010101';
		
		#Если МобильноеПриложениеСервер Тогда
			
			НовыйДокумент.КассаККМ = ОбщегоНазначенияМПВызовСервера.ПолучитьЗначениеКонстанты("КассаККММобильногоПриложения");
			Если ЗначениеЗаполнено(НовыйДокумент.КассаККМ) Тогда
				НовыйДокумент.РозничнаяТочка = НовыйДокумент.КассаККМ.РозничнаяТочка;
			КонецЕсли;
			
		#КонецЕсли
		
		Если НовыйДокумент.ПроверитьЗаполнение() Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			ОтчетОРозничныхПродажах = НовыйДокумент.Ссылка;
		Иначе
			Результат = Ложь;
			Сообщить("ru = 'Проверьте настройки кассы ККМ.'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура выполняет закрытие кассовой смены.
//
Функция ЗакрытьКассовуюСмену() Экспорт
	
	ОтчетОРозничныхПродажах = Неопределено;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены();
	
	Если НЕ ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах) Тогда
		Возврат Новый Структура("ОписаниеОшибки", НСтр("ru='Не найдена открытая смена'"));
	КонецЕсли;
	
	ОтчетОРозничныхПродажахОбъект = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах.ПолучитьОбъект();
	СтруктураВозвращаемоеЗначение = ЗаполнитьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект);
	
	Возврат СтруктураВозвращаемоеЗначение;
	
КонецФункции // СформироватьОтчетОРозничныхПродажахИВыполнитьАрхивацию()

Функция ЕстьПодключенныеКассыККМ() Экспорт
	
	МассивОборудования = Новый Массив;
	МассивОборудования.Добавить("ФискальныйРегистратор");
	МассивОборудования.Добавить("ККТ");
	
	Результат = Справочники.ПодключаемоеОборудование.ОборудованиеПоПараметрам(МассивОборудования);
	
	Возврат Результат.Количество() > 0;
	
КонецФункции

Функция ПолучитьСистемуНалогообложенияККТ() Экспорт
	
	СистемаНалогообложения = Константы.СистемаНалогообложенияМП.Получить();
	
	Если СистемаНалогообложения = Перечисления.СистемыНалогообложенияМП.Общая Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложенияМП.УпрощеннаяДоход Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложенияМП.УпрощеннаяДоходМинусРасход Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложенияМП.ЕдиныйНалогНаВмененныйДоход Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложенияМП.ЕдиныйСельскохозяйственныйНалог Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ЕСН;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложенияМП.Патентная Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.Патент;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСуммуПродажЗаТекущуюСмену() Экспорт
	
	СостояниеСмены = ПолучитьСостояниеКассовойСмены();
	Если ЗначениеЗаполнено(СостояниеСмены.ОтчетОРозничныхПродажах)
		И СостояниеСмены.СменаОткрыта Тогда
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЧекККМ.СуммаДокумента) КАК СуммаДокумента
		|ИЗ
		|	Документ.ЧекККММП КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|	И ЧекККМ.Проведен";
		Запрос.УстановитьПараметр("ОтчетОРозничныхПродажах", СостояниеСмены.ОтчетОРозничныхПродажах);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.СуммаДокумента;
		Иначе
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат НСтр("ru='Нет открытых смен'");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПризнакПредметаРасчетаТовара(Товар) Экспорт
	
	Если Товар.Вид = Перечисления.ВидыТоваровМП.Услуга Тогда
		Возврат Перечисления.ПризнакиПредметаРасчета.Услуга;
	ИначеЕсли Товар.Вид = Перечисления.ВидыТоваровМП.Товар Тогда
		Возврат Перечисления.ПризнакиПредметаРасчета.Товар;
	Иначе
		Возврат Перечисления.ПризнакиПредметаРасчета.ИнойПредметРасчета;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНомерСмены() Экспорт
	
	ОткрытаяСмена = ПолучитьСмену();
	
	Если ОткрытаяСмена <> Неопределено Тогда
		Возврат ОткрытаяСмена.Номер;
	КонецЕсли;
	
	ПоследняяСмена = ПолучитьПоследнююЗакрытуюСмену();
	
	Если ПоследняяСмена <> Неопределено Тогда
		Возврат ПоследняяСмена.Номер + 1;
	КонецЕсли;
	
	НомерПервойСмены = 1;
	Возврат НомерПервойСмены;
	
КонецФункции

Функция ПолучитьСмену() Экспорт
	
	КассоваяСмена = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажахМП КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСменыМП.Открыта)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПоследнююЗакрытуюСмену()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажахМП КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСменыМП.Закрыта)
	|	И КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСменыМП.ЗакрытаЧекиЗаархивированы)
	|	И КассоваяСмена.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
